---
kind: type
id: T:Autodesk.Revit.DB.ModifierType
source: html/14da29ca-e466-9c3f-7a5b-5988a0e0ef6b.htm
---
# Autodesk.Revit.DB.ModifierType

An enumerated type listing options to appear in the exported layer name.

## Syntax (C#)
```csharp
public enum ModifierType
```